# YVec Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Plane..::..YVec Property
Plane Class See Also
---
Axis defining the second parametric direction of the plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ YVec { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YVec As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YVec {
	XYZ^ get ();
}
```

# See Also
Plane Class
Autodesk.Revit.DB Namespace